/*---------------------------------------------------------------------*/
/* ------------------- Web: www.STCAI.com -----------------------------*/
/*---------------------------------------------------------------------*/

#include	"AI8051U_Exti.h"

#include "include.h"
//========================================================================
//                               本地变量声明
//========================================================================

// u8 WakeUpSource;
//========================================================================
// 函数: INT0_ISR_Handler
// 描述: INT0中断函数.  管脚 P3.2
// 参数: none.
// 返回: none.
// 版本: V1.0, 2020-09-23
//========================================================================
void INT0_ISR_Handler (void) interrupt INT0_VECTOR		//进中断时已经清除标志
{
	// TODO: 在此处添加用户代码
//	LED_Ctrl(LED0,RVS);
}

//========================================================================
// 函数: INT1_ISR_Handler
// 描述: INT1中断函数.  管脚 P3.3
// 参数: none.
// 返回: none.
// 版本: V1.0, 2020-09-23
//========================================================================
void INT1_ISR_Handler (void) interrupt INT1_VECTOR		//进中断时已经清除标志
{
	// TODO: 在此处添加用户代码
//	LED_Ctrl(LED0,RVS);
//#ifdef USE_LCD
//    LCD_ShowStr_24(0,3,"P3.3INT-->LED0 ",YELLOW,LIGHTBLUE);            //显示24*12字符串  
//#else
//    OLED_P6x8Str(5,3, "P3.3INT-->LED0");    LCD_CLS(BLACK);
//#endif
 
}

//========================================================================
// 函数: INT2_ISR_Handler
// 描述: INT2中断函数. 管脚P3.3
// 参数: none.
// 返回: none.
// 版本: V1.0, 2020-09-23
//========================================================================
void INT2_ISR_Handler (void) interrupt INT2_VECTOR		//进中断时已经清除标志
{
	// TODO: 在此处添加用户代码
//	LED_Ctrl(LED0,RVS);
}

//========================================================================
// 函数: INT3_ISR_Handler
// 描述: INT3中断函数. 管脚P3.7
// 参数: none.
// 返回: none.
// 版本: V1.0, 2020-09-23
//========================================================================
void INT3_ISR_Handler (void) interrupt INT3_VECTOR		//进中断时已经清除标志
{
	// TODO: 在此处添加用户代码
//	LED_Ctrl(LED0,RVS);
}

//========================================================================
// 函数: INT4_ISR_Handler
// 描述: INT4中断函数. 管脚P3.0
// 参数: none.
// 返回: none.
// 版本: V1.0, 2020-09-23
//========================================================================
void INT4_ISR_Handler (void) interrupt INT4_VECTOR		//进中断时已经清除标志
{
	// TODO: 在此处添加用户代码
//	LED_Ctrl(LED0,RVS);
//    OLED_P6x8Str(5,3, " EXINT ->P3.0");
}
